CommunityGD32Cores/GD32Firmware/GD32W51x/GD32W51x_standard_peripheral/Include/gd32w51x_dma.h
/* DMA singledata mode initialize struct */
typedef struct
{
    uint32_t periph_addr;                           /*!< peripheral base address */
    uint32_t periph_inc;                            /*!< peripheral increasing mode */  

    uint32_t memory0_addr;                          /*!< memory 0 base address */
    uint32_t memory_inc;                            /*!< memory increasing mode */

    uint32_t periph_memory_width;                   /*!< transfer data size of peripheral */

    uint32_t circular_mode;                         /*!< DMA circular mode */
    uint32_t direction;                             /*!< channel data transfer direction */
    uint32_t number;                                /*!< channel transfer number */
    uint32_t priority;                              /*!< channel priority level */
}dma_single_data_parameter_struct;

#define DMA_FLAG_ADD(flag, channel)    ((uint32_t)((flag) << ((((uint32_t)(channel) * 6U)) + ((uint32_t)(((uint32_t)(channel)) >> 1U) & 0x01U) * 4U)))   /*!< DMA channel flag shift */

/* DMA_register address */
#define DMA_CHCTL(dma, channel)            REG32(((dma) + 0x10U) + 0x18U * (channel))  /*!< the address of DMA channel CHXCTL register  */
#define DMA_CHCNT(dma, channel)            REG32(((dma) + 0x14U) + 0x18U * (channel))  /*!< the address of DMA channel CHXCNT register */
#define DMA_CHPADDR(dma, channel)          REG32(((dma) + 0x18U) + 0x18U * (channel))  /*!< the address of DMA channel CHXPADDR register */
#define DMA_CHM0ADDR(dma, channel)         REG32(((dma) + 0x1CU) + 0x18U * (channel))  /*!< the address of DMA channel CHXM0ADDR register */
#define DMA_CHM1ADDR(dma, channel)         REG32(((dma) + 0x20U) + 0x18U * (channel))  /*!< the address of DMA channel CHXM1ADDR register */
#define DMA_CHFCTL(dma, channel)           REG32(((dma) + 0x24U) + 0x18U * (channel))  /*!< the address of DMA channel CHXMADDR register */
#define DMA_CHSCTL(dma, channel)           REG32(((dma) + 0x108U) + 0x4U * (channel))  /*!< the address of DMA channel CHXSCTL register */

/* peripheral select */
#define CHCTL_PERIEN(regval)               (BITS(25, 27) & ((uint32_t)(regval) << 25U))
#define DMA_PERIPH_0_SELECT                CHCTL_PERIEN(0)                           /*!< peripheral 0 select */
#define DMA_PERIPH_1_SELECT                CHCTL_PERIEN(1)                           /*!< peripheral 1 select */
#define DMA_PERIPH_2_SELECT                CHCTL_PERIEN(2)                           /*!< peripheral 2 select */
#define DMA_PERIPH_3_SELECT                CHCTL_PERIEN(3)                           /*!< peripheral 3 select */
#define DMA_PERIPH_4_SELECT                CHCTL_PERIEN(4)                           /*!< peripheral 4 select */
#define DMA_PERIPH_5_SELECT                CHCTL_PERIEN(5)                           /*!< peripheral 5 select */
#define DMA_PERIPH_6_SELECT                CHCTL_PERIEN(6)                           /*!< peripheral 6 select */
#define DMA_PERIPH_7_SELECT                CHCTL_PERIEN(7)                           /*!< peripheral 7 select */

/* burst type of memory */
#define CHCTL_MBURST(regval)               (BITS(23, 24) & ((uint32_t)(regval) << 23U))
#define DMA_MEMORY_BURST_SINGLE            CHCTL_MBURST(0)                           /*!< single burst */
#define DMA_MEMORY_BURST_4_BEAT            CHCTL_MBURST(1)                           /*!< 4-beat burst */
#define DMA_MEMORY_BURST_8_BEAT            CHCTL_MBURST(2)                           /*!< 8-beat burst */
#define DMA_MEMORY_BURST_16_BEAT           CHCTL_MBURST(3)                           /*!< 16-beat burst */

/* burst type of peripheral */
#define CHCTL_PBURST(regval)               (BITS(21, 22) & ((uint32_t)(regval) << 21U))
#define DMA_PERIPH_BURST_SINGLE            CHCTL_PBURST(0)                           /*!< single burst */
#define DMA_PERIPH_BURST_4_BEAT            CHCTL_PBURST(1)                           /*!< 4-beat burst */
#define DMA_PERIPH_BURST_8_BEAT            CHCTL_PBURST(2)                           /*!< 8-beat burst */
#define DMA_PERIPH_BURST_16_BEAT           CHCTL_PBURST(3)                           /*!< 16-beat burst */

/* channel priority level */
#define CHCTL_PRIO(regval)                 (BITS(16, 17) & ((uint32_t)(regval) << 16U))
#define DMA_PRIORITY_LOW                   CHCTL_PRIO(0)                             /*!< low priority */
#define DMA_PRIORITY_MEDIUM                CHCTL_PRIO(1)                             /*!< medium priority */
#define DMA_PRIORITY_HIGH                  CHCTL_PRIO(2)                             /*!< high priority */
#define DMA_PRIORITY_ULTRA_HIGH            CHCTL_PRIO(3)                             /*!< ultra high priority */

/* transfer data width of memory */
#define CHCTL_MWIDTH(regval)               (BITS(13, 14) & ((uint32_t)(regval) << 13U))
#define DMA_MEMORY_WIDTH_8BIT              CHCTL_MWIDTH(0)                           /*!< transfer data width of memory is 8-bit */
#define DMA_MEMORY_WIDTH_16BIT             CHCTL_MWIDTH(1)                           /*!< transfer data width of memory is 16-bit */
#define DMA_MEMORY_WIDTH_32BIT             CHCTL_MWIDTH(2)                           /*!< transfer data width of memory is 32-bit */

/* transfer data width of peripheral */
#define CHCTL_PWIDTH(regval)               (BITS(11, 12) & ((uint32_t)(regval) << 11U))
#define DMA_PERIPH_WIDTH_8BIT              CHCTL_PWIDTH(0)                           /*!< transfer data width of peripheral is 8-bit */
#define DMA_PERIPH_WIDTH_16BIT             CHCTL_PWIDTH(1)                           /*!< transfer data width of peripheral is 16-bit */
#define DMA_PERIPH_WIDTH_32BIT             CHCTL_PWIDTH(2)                           /*!< transfer data width of peripheral is 32-bit */

/* channel transfer mode */
#define CHCTL_TM(regval)                   (BITS(6, 7) & ((uint32_t)(regval) << 6U))
#define DMA_PERIPH_TO_MEMORY               CHCTL_TM(0)                               /*!< read from peripheral and write to memory */
#define DMA_MEMORY_TO_PERIPH               CHCTL_TM(1)                               /*!< read from memory and write to peripheral */
#define DMA_MEMORY_TO_MEMORY               CHCTL_TM(2)                               /*!< read from memory and write to memory */

/* FIFO counter critical value */
#define CHFCTL_FCCV(regval)                (BITS(0, 1) & ((uint32_t)(regval) << 0U))
#define DMA_FIFO_1_WORD                    CHFCTL_FCCV(0)                            /*!< critical value 1 word */
#define DMA_FIFO_2_WORD                    CHFCTL_FCCV(1)                            /*!< critical value 2 word */
#define DMA_FIFO_3_WORD                    CHFCTL_FCCV(2)                            /*!< critical value 3 word */
#define DMA_FIFO_4_WORD                    CHFCTL_FCCV(3)                            /*!< critical value 4 word */

/* memory select */
#define DMA_MEMORY_0                       ((uint32_t)0x00000000U)                   /*!< select memory0 as memory transfer area */
#define DMA_MEMORY_1                       ((uint32_t)0x00000001U)                   /*!< select memory1 as memory transfer area */

/* DMA circular mode */
#define DMA_CIRCULAR_MODE_ENABLE           ((uint32_t)0x00000000U)                   /*!< circular mode enable */
#define DMA_CIRCULAR_MODE_DISABLE          ((uint32_t)0x00000001U)                   /*!< circular mode disable */

